Documents/ВозвратТоваровОтКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВозвратТоваровОтКлиента</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ТоварыВКоробах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>IDКороба</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПар</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УпаковочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УпаковочныйЛист</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладУпаковки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратТоваровОтКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
	// добавление реквизитов на форму
	// Галфинд_Домнышева 2022/10/07
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	
	НовыйЭлемент = Элементы.Вставить("гф_СтраницаТоварыВКоробах", ТипГруппаФормы, Элементы.ГруппаСтраницы, 
					Элементы.ГруппаТовары);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Товары в коробах";
	НовыйЭлемент.Подсказка = "Товары в коробах";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ТаблицаФормы = Элементы.Вставить("гф_ТоварыВКоробах", ТипТаблицаФормы, Элементы.гф_СтраницаТоварыВКоробах);
	ТаблицаФормы.ПутьКДанным = "Объект.гф_ТоварыВКоробах";
	ТаблицаФормы.УстановитьДействие("ПередУдалением", "гф_ТоварыВКоробахПередУдалением");

	НовыйЭлемент  = Элементы.Добавить("гф_ТоварыВКоробахНомерСтроки", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТоварыВКоробах.НомерСтроки";

	НовыйЭлемент  = Элементы.Добавить("гф_ТоварыВКоробахУпаковочныйЛист", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТоварыВКоробах.УпаковочныйЛист";
	
	НовыйЭлемент  = Элементы.Добавить("гф_ТоварыВКоробахАртикул", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТоварыВКоробах.Артикул";
	
	НовыйЭлемент  = Элементы.Добавить("гф_ТоварыВКоробахIDКороба", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТоварыВКоробах.IDКороба";

	НовыйЭлемент  = Элементы.Добавить("гф_ТоварыВКоробахКоличествоПар", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТоварыВКоробах.КоличествоПар";
	
	Команда = Команды.Добавить("гф_КомандаПодборТовара");
	Команда.Действие = "гф_КомандаПодборТовара";

	НовыйЭлемент = Элементы.Вставить("гф_ПодборТовара", ТипКнопкаФормы, ТаблицаФормы.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Подбор";
	НовыйЭлемент.ИмяКоманды = "гф_КомандаПодборТовара";
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		
	Если ЗначениеЗаполнено(Объект.Склад) Тогда 
         ВидимостьСтраницыТоварыВКоробах();
	КонецЕсли;
	// } #wortmann   
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы   

// #wortmann {
// открытие формы подбора УЛ
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06
&НаКлиенте
Процедура гф_КомандаПодборТовара(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Реализация",	Объект.ДокументРеализации);
	ПараметрыФормы.Вставить("Организация",			Объект.Организация); 
	ПараметрыФормы.Вставить("Партнер",			Объект.Партнер);
	
	ОповещениеПодбора = Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ВозвратТоваровОтКлиента.Форма.гф_ФормаПодбораДокументовИУЛ", ПараметрыФормы, ЭтаФорма, , , ,
	ОповещениеПодбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры// } #wortmann 

// #wortmann {
// заполнение ТЧ гф_ТоварыВКоробах по закрытию формы Подбора 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаКлиенте
Процедура ПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
					
			Для каждого СтруДанных Из Результат Цикл
				
				Если Объект.гф_ТоварыВКоробах.НайтиСтроки(СтруДанных).Количество() = 0 Тогда
					строкаТоваровВКоробах = Объект.гф_ТоварыВКоробах.Добавить();
					ЗаполнитьЗначенияСвойств(строкаТоваровВКоробах, СтруДанных);
					ЗагрузитьТоварыПоУЛ(СтруДанных.УпаковочныйЛист);
					ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
					ОбновитьТЧТовары (СтруктураДействий, КэшированныеЗначения);
					
				КонецЕсли;
				
			КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры// } #wortmann

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

// #wortmann { 
// вызов процедуры по настройке видимости страницы гф_СтраницаТоварыВКоробах 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаКлиенте
Процедура гф_СкладПриИзмененииПосле(Элемент)
	
	ВидимостьСтраницыТоварыВКоробах();
	
КонецПроцедуры// } #wortmann 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #wortmann { 
// настройка видимости созданной страницы гф_СтраницаТоварыВКоробах согласно 
// значению доп.реквизита "Товары в коробах" 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаСервере
Процедура ВидимостьСтраницыТоварыВКоробах() 
	
	СвойствоТоварыВКоробах = УправлениеСвойствами.ЗначениеСвойства(Объект.Склад, "гф_СкладыТоварыВКоробах"); 
	
	ДоступностьТоварыВКоробах = ?(СвойствоТоварыВКоробах = Неопределено, Ложь, СвойствоТоварыВКоробах);
	
	Элементы["гф_СтраницаТоварыВКоробах"].Доступность = ДоступностьТоварыВКоробах;
	
	Если Не ДоступностьТоварыВКоробах И Объект.гф_ТоварыВКоробах.Количество() Тогда
		
		Объект.гф_ТоварыВКоробах.Очистить();
		
	КонецЕсли;	
   	
КонецПроцедуры// } #wortmann

// #wortmann { 
// заполняет ТЧ Товары 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаСервере
Процедура ЗагрузитьТоварыПоУЛ(УпаковочныйЛист)
   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.Назначение КАК Назначение,
		|	УпаковочныйЛистТовары.Количество КАК Количество
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка = &УпаковочныйЛист";
	
	Запрос.УстановитьПараметр("УпаковочныйЛист", УпаковочныйЛист);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		СтруВыборки = Новый Структура("Номенклатура, Характеристика, Назначение");
		
		ЗаполнитьЗначенияСвойств(СтруВыборки, Выборка);
		
		Если Объект.Товары.НайтиСтроки(СтруВыборки).Количество() = 0 Тогда
			СтрокаТоваров = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, Выборка);
			СтрокаТоваров.КоличествоУпаковок = Выборка.Количество;			
		ИначеЕсли Объект.Товары.НайтиСтроки(СтруВыборки).Количество() > 0 Тогда	
			Объект.Товары.НайтиСтроки(СтруВыборки)[0].КоличествоУпаковок = 
										Объект.Товары.НайтиСтроки(СтруВыборки)[0].КоличествоУпаковок + Выборка.Количество;
		КонецЕсли;
	КонецЦикла;
		
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
											Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
											Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
											Новый Структура("Номенклатура", "ТипНоменклатуры"));																				
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
   
КонецПроцедуры// } #wortmann 

// #wortmann {
// Вызов проц УдалитьТовары при удалении строки из ТЧ гф_ТоварыВКоробах  
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаКлиенте
Процедура гф_ТоварыВКоробахПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.гф_ТоварыВКоробах.ТекущиеДанные;
	УпаковочныйЛист = ТекущиеДанные.УпаковочныйЛист;
	УдалитьТовары(УпаковочныйЛист);
КонецПроцедуры// } #wortmann

// #wortmann { 
// Удаляем товары из ТЧ Товары при удалении УЛ 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06	
&НаСервере
Процедура УдалитьТовары(УпаковочныйЛист)
   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.Назначение КАК Назначение,
		|	УпаковочныйЛистТовары.Количество КАК Количество
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка = &УпаковочныйЛист";
	
	Запрос.УстановитьПараметр("УпаковочныйЛист", УпаковочныйЛист);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		СтруВыборки = Новый Структура("Номенклатура, Характеристика, Назначение");
		ЗаполнитьЗначенияСвойств(СтруВыборки, Выборка);
		
		Если Объект.Товары.НайтиСтроки(СтруВыборки).Количество() > 0 Тогда	
			Объект.Товары.НайтиСтроки(СтруВыборки)[0].КоличествоУпаковок = 
			Объект.Товары.НайтиСтроки(СтруВыборки)[0].КоличествоУпаковок - Выборка.Количество;	
			Объект.Товары.НайтиСтроки(СтруВыборки)[0].Количество = Объект.Товары.НайтиСтроки(СтруВыборки)[0].КоличествоУпаковок;							
			Если Объект.Товары.НайтиСтроки(СтруВыборки)[0].Количество = 0 Тогда
				Индекс = Объект.Товары.НайтиСтроки(СтруВыборки)[0].НомерСтроки;
				Объект.Товары.Удалить(Индекс - 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	   
КонецПроцедуры// } #wortmann 

// #wortmann { 
// Вызов серверной процедуры из общего модуля по обработке ТЧ Товары 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8121bcee7bda45d711ed43f091be2e6a
// Галфинд_Домнышева 2022/10/06
&НаСервере
Процедура ОбновитьТЧТовары (СтруктураДействий, КэшированныеЗначения)

	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры;

#КонецОбласти
